platform/symbian/rhodes/rho/apps/app/AsyncHttpsTest/body.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <Login xmlns="http://agentfirstws.firstam.com/">
            <requestXML>
                &lt;AgentFirstWS&gt;
                &lt;UserName&gt;slagent&lt;/UserName&gt;
                &lt;Password&gt;thepassword&lt;/Password&gt;
                &lt;/AgentFirstWS&gt;
            </requestXML>
        </Login>
    </soap:Body>
</soap:Envelope>
